app/controllers/ajax_controller.rb

  def find_listings
    company, city, state = *[params[:company], params[:city], params[:state]].map { |p| p.downcase.gsub(/\\|'/) { |c| "\\#{c}" } } # strip quotes
    @listings = Listing.find_listings_by_company_city_and_state company, city, state
---
SELECT * FROM "listings" WHERE ("listings".user_id = 25586)