app/controllers/clients_controller.rb

  def edit
    redirect_to client_account_path if params[:id] && (current_user && current_user.has_role?('advertiser'))

    if @client.nil?
      redirect_to new_client_path
    else
      @title = current_user.company
      @listings = @client.listings.paginate(:conditions => 'enabled IS TRUE', :per_page => 10, :page => params[:page], :order => 'id DESC')
---
SELECT * FROM "listings" WHERE ("listings".user_id = 25586 AND (enabled IS TRUE)) ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "listings" WHERE ("listings".user_id = 25586 AND (enabled IS TRUE))

  def create_note
    @client = Client.find params[:id]
    @note = @client.notes.build params[:note].merge(:created_by => current_user.id)

    respond_to do |format|
      format.html do
        if @note.save
---
INSERT INTO "notes" ("created_at", "updated_at", "created_by", "user_id", "content", "status") VALUES('2011-04-26 22:25:46.189702', '2011-04-26 22:25:46.189702', 1, 25586, E'Holy moly guacamole!', NULL) RETURNING "id"

  def delete_note
    @client = Client.find params[:id]
    @note = @client.notes.find params[:note_id]

    respond_to do |format|
      format.html do
        if @note.destroy
---
SELECT * FROM "notes" WHERE ("notes"."id" = 7 AND ("notes".user_id = 25586)) ORDER BY created_at DESC
DELETE FROM "notes" WHERE "id" = 7