app/controllers/listings_controller.rb

SELECT * FROM "pages" WHERE ("pages"."title" = E'Self Storage') LIMIT 1
SELECT * FROM "searches" WHERE ("searches"."id" = 39703) LIMIT 1
SELECT * FROM "unit_types" WHERE ("unit_types".size_id = 14725) LIMIT 1
---
  def locator
    # we replaced a normal page model by a controller action, but we still need data from the model to describe this "page"
    @page = Page.find_by_title 'Self Storage'
    @unit_size_thumbs = SizeIcon.thumb_icons
    @search = Search.new

    if params[:storage_type] # clicked on one of the storage types links
      @prev_search = Search.create_from_geoloc session[:geo_location], params[:storage_type]

    elsif flash[:search_id] # redirected from the search controller
      @prev_search = Search.find flash[:search_id]

UPDATE "users" SET "updated_at" = '2011-04-27 16:49:24.489999', "perishable_token" = E'uP__ZwhTGKkWLbF9rmka', "last_request_at" = '2011-04-27 16:49:24.487733' WHERE "id" = 3
---

    @listings = @listings.paginate :page => params[:page], :per_page => (params[:per_page] || @listings_per_page)
    # updates the impressions only for listings on current page
    @listings.map { |m| m.update_stat 'impressions', request } unless current_user && current_user.has_role?('admin', 'advertiser')