app/controllers/notes_controller.rb

INSERT INTO "notes" ("created_at", "updated_at", "created_by", "user_id", "content", "status") VALUES('2011-04-26 22:03:44.485215', '2011-04-26 22:03:44.485215', 1, 25586, E'test note ove hee', NULL) RETURNING "id"
---
  def create
    @client = Client.find params[:client_id]
    @note = @client.notes.build params[:note].merge(:created_by => current_user.id)

    respond_to do |format|
      format.html do
        if @note.save